zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW43B43ZC7/drivers/fsl_clock.c
/*
 * Copyright 2025-2026 NXP
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_clock.h"

/*
 * $Coverage Justification Reference$
 *
 * $Justification clock_c_ref_1$
 * The platform can select only four clock sources.
 *
 * $Justification clock_c_ref_2$
 * After the board starts, the SIRC clock source is always enable and valid.
 *
 * $Justification clock_c_ref_3$
 * During the init FIRC process, the De-init Firc is first performed.
 * In this process, the successful De-init will Write One to clear the
 * FIRCERR bit of the FIRCCSR register.And trim, has only two modes to
 * choose from, and the setting trim mode is always successful.
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.clock"
#endif

/*! @brief Slow IRC clock frequency. */
#define SCG_SIRC_FREQ 6000000U
/*! @brief Get the RANGE value of the Fast IRC. */
#define SCG_FIRCCFG_RANGE_VAL ((CLOCK_REG(&SCG_0->FIRCCFG) & SCG_FIRCCFG_RANGE_MASK) >> SCG_FIRCCFG_RANGE_SHIFT)
/*! @brief Get the value of each field in MRCC register. */
#define MRCC_MUX_VAL(reg) (((reg)&MRCC_MUX_MASK) >> MRCC_MUX_SHIFT)

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*! @brief External XTAL0 (OSC0) clock frequency. */
volatile uint32_t g_xtal0Freq;
/*! @brief External XTAL32K clock frequency. */
volatile uint32_t g_xtal32Freq;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * brief Get the flash clock frequency.
 *
 * return Clock frequency in Hz.
 */
uint32_t CLOCK_GetFlashClkFreq(void)
{
    return CLOCK_GetSysClkFreq(kSCG_SysClkSlow);
}

/*!
 * brief Get the bus clock frequency.
 *
 * return Clock frequency in Hz.
 */
uint32_t CLOCK_GetBusClkFreq(void)
{
    return CLOCK_GetSysClkFreq(kSCG_SysClkBus);
}

/*!
 * brief Get the platform clock frequency.
 *
 * return Clock frequency in Hz.
 */
uint32_t CLOCK_GetPlatClkFreq(void)
{
    return CLOCK_GetSysClkFreq(kSCG_SysClkPlatform);
}

/*!
 * brief Get the core clock or system clock frequency.
 *
 * return Clock frequency in Hz.
 */
uint32_t CLOCK_GetCoreSysClkFreq(void)
{
    return CLOCK_GetSysClkFreq(kSCG_SysClkCore);
}

/*!
 * brief Gets the clock frequency for a specific clock name.
 *
 * This function checks the current clock configurations and then calculates
 * the clock frequency for a specific clock name defined in clock_name_t.
 *
 * param clockName Clock names defined in clock_name_t
 * return Clock frequency value in hertz
 */
uint32_t CLOCK_GetFreq(clock_name_t clockName)
{
    uint32_t freq;

    switch (clockName)
    {
        /* System layer clock. */
        case kCLOCK_CoreSysClk:
            freq = CLOCK_GetSysClkFreq(kSCG_SysClkCore);
            break;
        case kCLOCK_PlatClk:
            freq = CLOCK_GetSysClkFreq(kSCG_SysClkPlatform);
            break;
        case kCLOCK_BusClk:
            freq = CLOCK_GetSysClkFreq(kSCG_SysClkBus);
            break;
        case kCLOCK_SlowClk:
            freq = CLOCK_GetSysClkFreq(kSCG_SysClkSlow);
            break;
        /* Current active system clock source (pre-divider). */
        case kCLOCK_SysClk:
        {
            scg_sys_clk_config_t sysClkConfig;
            CLOCK_GetCurSysClkConfig(&sysClkConfig);
            switch ((scg_sys_clk_src_t)sysClkConfig.src)
            {
                case kSCG_SysClkSrcSysOsc:
                    freq = CLOCK_GetSysOscFreq();
                    break;
                case kSCG_SysClkSrcSirc:
                    freq = CLOCK_GetSircFreq();
                    break;
                case kSCG_SysClkSrcFirc:
                    freq = CLOCK_GetFircFreq();
                    break;
                case kSCG_SysClkSrcRosc:
                    freq = CLOCK_GetRtcOscFreq();
                    break;
                default:
                    freq = 0U;
                    break;
            }
            break;
        }
        /* SCG system OSC clock source. */
        case kCLOCK_ScgSysOscClk:
            freq = CLOCK_GetSysOscFreq();
            break;
        case kCLOCK_ScgSircClk:
            freq = CLOCK_GetSircFreq();
            break;
        case kCLOCK_ScgFircClk:
            freq = CLOCK_GetFircFreq();
            break;
        case kCLOCK_RtcOscClk:
            freq = CLOCK_GetRtcOscFreq();
            break;
        default:
            freq = 0U;
            break;
    }
    return freq;
}

/*!
 * brief Gets the functional clock frequency for a specific IP module.
 *
 * This function gets the IP module's functional clock frequency based on MRCC
 * registers. It is only used for the IP modules which could select clock source
 * by MRCC[MUX].
 *
 * param name Which peripheral to get, see \ref clock_ip_name_t.
 * return Clock frequency value in Hz
 */
uint32_t CLOCK_GetIpFreq(clock_ip_name_t name)
{
    if (kCLOCK_NOGATE == name)
    {
        return 0U;
    }

    uint32_t reg  = CLOCK_REG(name);
    uint32_t freq = 0U;

    volatile uint32_t *pDivCtrl = CLOCK_GetClockDivider(name);
    uint32_t div                = (pDivCtrl != NULL) ? *pDivCtrl : 0U;

    assert(reg & MRCC_PR_MASK);

    switch (name)
    {
        case kCLOCK_Lpi2c0:
        case kCLOCK_Lpi2c1:
        case kCLOCK_Lpspi1:
        case kCLOCK_Lpspi2:
        case kCLOCK_Lptmr0:
        case kCLOCK_Lptmr1:
        case kCLOCK_Lpit0:
        case kCLOCK_Lpadc0:
            switch (MRCC_MUX_VAL(reg))
            {
                case (uint32_t)kCLOCK_IpSrcFro6M:
                    freq = CLOCK_GetSircFreq() / (((div & MRCC_DIV_MASK) >> MRCC_DIV_SHIFT) + 1U);
                    break;
                case (uint32_t)kCLOCK_IpSrcFro192M:
                    freq = CLOCK_GetFircFreq() / (((div & MRCC_DIV_MASK) >> MRCC_DIV_SHIFT) + 1U);
                    break;
                case (uint32_t)kCLOCK_IpSrcSoscClk:
                    freq = CLOCK_GetSysOscFreq() / (((div & MRCC_DIV_MASK) >> MRCC_DIV_SHIFT) + 1U);
                    break;
                default:
                    freq = 0U;
                    break;
            }
            break;
        case kCLOCK_Lpuart0:
        case kCLOCK_Lpuart1:
        case kCLOCK_Tpm0:
        case kCLOCK_Tpm1:
        case kCLOCK_Tpm2:
        case kCLOCK_Tpm3:
        case kCLOCK_Tpm4:
            switch (MRCC_MUX_VAL(reg))
            {
                case (uint32_t)kCLOCK_IpSrcFro6M:
                    freq = CLOCK_GetSircFreq() / (((div & MRCC_DIV_MASK) >> MRCC_DIV_SHIFT) + 1U);
                    break;
                case (uint32_t)kCLOCK_IpSrcFro192M:
                    freq = CLOCK_GetFircFreq() / (((div & MRCC_DIV_MASK) >> MRCC_DIV_SHIFT) + 1U);
                    break;
                case (uint32_t)kCLOCK_IpSrcSoscClk:
                    freq = CLOCK_GetSysOscFreq() / (((div & MRCC_DIV_MASK) >> MRCC_DIV_SHIFT) + 1U);
                    break;
                case (uint32_t)kCLOCK_IpSrc32kClk:
                    freq = CLOCK_GetRtcOscFreq() / (((div & MRCC_DIV_MASK) >> MRCC_DIV_SHIFT) + 1U);
                    break;
                default:
                    freq = 0U;
                    break;
            }
            break;
        case kCLOCK_Can0:
            switch (MRCC_MUX_VAL(reg))
            {
                case (uint32_t)kCLOCK_IpSrcFro192M:
                    freq = CLOCK_GetFircFreq() / (((div & MRCC_DIV_MASK) >> MRCC_DIV_SHIFT) + 1U);
                    break;
                case (uint32_t)kCLOCK_IpSrcSoscClk:
                    freq = CLOCK_GetSysOscFreq() / (((div & MRCC_DIV_MASK) >> MRCC_DIV_SHIFT) + 1U);
                    break;
                case (uint32_t)kCLOCK_IpSrcFro200M:
                    freq = 200000000U / (((div & MRCC_DIV_MASK) >> MRCC_DIV_SHIFT) + 1U);
                    break;
                default:
                    freq = 0U;
                    break;
            }
            break;
        case kCLOCK_Tstmr0:
            switch (MRCC_MUX_VAL(reg))
            {
                case (uint32_t)kCLOCK_IpSrcFro192M:
                    freq = CLOCK_GetFircFreq();
                    break;
                case (uint32_t)kCLOCK_IpSrcSoscClk:
                    freq = CLOCK_GetSysOscFreq();
                    break;
                case (uint32_t)kCLOCK_IpSrc32kClk:
                    freq = CLOCK_GetRtcOscFreq();
                    break;
                case (uint32_t)kCLOCK_IpSrc1M:
                    freq = CLOCK_Get1MClkFreq();
                    break;
                default:
                    freq = 0U;
                    break;
            }
            break;
        case kCLOCK_Lpspi0:
            switch (MRCC_MUX_VAL(reg))
            {
                case (uint32_t)kCLOCK_IpSrcFro6M:
                    freq = CLOCK_GetSircFreq() / (((div & MRCC_DIV_MASK) >> MRCC_DIV_SHIFT) + 1U);
                    break;
                case (uint32_t)kCLOCK_IpSrcFro192M:
                    freq = CLOCK_GetFircFreq() / (((div & MRCC_DIV_MASK) >> MRCC_DIV_SHIFT) + 1U);
                    break;
                case (uint32_t)kCLOCK_IpSrcSoscClk:
                    freq = CLOCK_GetSysOscFreq() / (((div & MRCC_DIV_MASK) >> MRCC_DIV_SHIFT) + 1U);
                    break;
                case (uint32_t)kCLOCK_IpSrc1M:
                    freq = CLOCK_Get1MClkFreq() / (((div & MRCC_DIV_MASK) >> MRCC_DIV_SHIFT) + 1U);
                    break;
                default:
                    freq = 0U;
                    break;
            }
            break;
        default:
            freq = 0U;
            break;
    }

    return freq;
}

/*!
 * brief Gets the SCG system clock frequency.
 *
 * This function gets the SCG system clock frequency. These clocks are used for
 * core, platform, external, and bus clock domains.
 *
 * param type     Which type of clock to get, core clock or slow clock.
 * return  Clock frequency.
 */
uint32_t CLOCK_GetSysClkFreq(scg_sys_clk_t type)
{
    uint32_t freq;

    scg_sys_clk_config_t sysClkConfig;

    CLOCK_GetCurSysClkConfig(&sysClkConfig); /* Get the main clock for SoC platform. */

