zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW43B43ZC7/drivers/fsl_clock.c
    /*
     * $Branch Coverage Justification$
     * ((sysClkConfig.src) != (kSCG_SysClkSrcSysOsc || kSCG_SysClkSrcSirc ||
     *   kSCG_SysClkSrcFirc || kSCG_SysClkSrcRosc)) not covered.
     * $ref clock_c_ref_1$.
     */
    switch ((scg_sys_clk_src_t)sysClkConfig.src)
    {
        case kSCG_SysClkSrcSysOsc:
            freq = CLOCK_GetSysOscFreq();
            break;
        case kSCG_SysClkSrcSirc:
            freq = CLOCK_GetSircFreq();
            break;
        case kSCG_SysClkSrcFirc:
            freq = CLOCK_GetFircFreq();
            break;
        case kSCG_SysClkSrcRosc:
            freq = CLOCK_GetRtcOscFreq();
            break;
        default:
            freq = 24000000U;
            break;
    }

    switch (type)
    {
        case kSCG_SysClkSlow:
            freq /= ((sysClkConfig.divCore + 1U) * (sysClkConfig.divSlow + 1U)); /* Divided by the DIVSLOW. */
            break;
        case kSCG_SysClkBus:
            freq /= ((sysClkConfig.divCore + 1U) * (sysClkConfig.divBus + 1U)); /* Divided by the DIVBUS. */
            break;
        case kSCG_SysClkCore1:
            freq /= ((sysClkConfig.divCore + 1U) * (sysClkConfig.divCore1 + 1U)); /* Divided by the DIVCORE1. */
            break;
        case kSCG_SysClkPlatform:
        case kSCG_SysClkCore:
            freq /= (sysClkConfig.divCore + 1U); /* Divided by the DIVCORE. */
            break;
        default:
            assert(false);
            break;
    }

    return freq;
}

/*!
 * brief Initializes the SCG system OSC.
 *
 * This function enables the SCG system OSC clock according to the
 * configuration.
 *
 * param config   Pointer to the configuration structure.
 * retval kStatus_Success System OSC is initialized.
 * retval kStatus_SCG_Busy System OSC has been enabled and is used by the system clock.
 * retval kStatus_ReadOnly System OSC control register is locked.
 *
 * note This function can't detect whether the system OSC has been enabled and
 * used by an IP.
 */
status_t CLOCK_InitSysOsc(const scg_sosc_config_t *config)
{
    assert(config);
    status_t status;

    /* De-init the SOSC first. */
    status = CLOCK_DeinitSysOsc();

    if (kStatus_Success != status)
    {
        return status;
    }

    CLOCK_REG(&SCG_0->SOSCCSR) = (uint32_t)config->enableMode | SCG_SOSCCSR_SOSCEN_MASK;

    CLOCK_SetSysOscMonitorMode(config->monitorMode);

    /* Wait for SOSC clock to be valid. */
    while ((CLOCK_REG(&SCG_0->SOSCCSR) & SCG_SOSCCSR_SOSCVLD_MASK) != SCG_SOSCCSR_SOSCVLD_MASK)
    {
    }

    CLOCK_SetXtal0Freq(config->freq);

    return (status_t)kStatus_Success;
}

/*!
 * brief De-initializes the SCG system OSC.
 *
 * This function disables the SCG system OSC clock.
 *
 * retval kStatus_Success System OSC is deinitialized.
 * retval kStatus_SCG_Busy System OSC is used by the system clock.
 * retval kStatus_ReadOnly System OSC control register is locked.
 *
 * note This function can't detect whether the system OSC is used by an IP.
 */
status_t CLOCK_DeinitSysOsc(void)
{
    uint32_t reg = CLOCK_REG(&SCG_0->SOSCCSR);

    /* If clock is used by system, return error. */
    if ((reg & SCG_SOSCCSR_SOSCSEL_MASK) == SCG_SOSCCSR_SOSCSEL_MASK)
    {
        return (status_t)kStatus_SCG_Busy;
    }

    /* If configure register is locked, return error. */
    if ((reg & SCG_SOSCCSR_LK_MASK) == SCG_SOSCCSR_LK_MASK)
    {
        return (status_t)kStatus_ReadOnly;
    }

    CLOCK_REG(&SCG_0->SOSCCSR) = SCG_SOSCCSR_SOSCERR_MASK;

    return (status_t)kStatus_Success;
}

/*!
 * brief Gets the SCG system oscillator clock frequency (SOSC).
 *
 * return  Clock frequency; If the clock is invalid, returns 0.
 */
uint32_t CLOCK_GetSysOscFreq(void)
{
    if ((CLOCK_REG(&SCG_0->SOSCCSR) & SCG_SOSCCSR_SOSCVLD_MASK) ==
        SCG_SOSCCSR_SOSCVLD_MASK) /* System OSC clock is valid. */
    {
        /* Please call CLOCK_SetXtal0Freq base on board setting before using OSC0 clock. */
        assert(g_xtal0Freq);
        return g_xtal0Freq;
    }
    else
    {
        return 0U;
    }
}

/*!
 * brief Initializes the SCG slow IRC clock.
 *
 * This function enables the SCG slow IRC clock according to the
 * configuration.
 *
 * param config   Pointer to the configuration structure.
 * retval kStatus_Success SIRC is initialized.
 * retval kStatus_SCG_Busy SIRC has been enabled and is used by system clock.
 * retval kStatus_ReadOnly SIRC control register is locked.
 *
 * note This function can't detect whether the system OSC has been enabled and
 * used by an IP.
 */
status_t CLOCK_InitSirc(const scg_sirc_config_t *config)
{
    assert(config);

    status_t status;

    /* De-init the SIRC first. */
    status = CLOCK_DeinitSirc();

    if (kStatus_Success != status)
    {
        return status;
    }

    CLOCK_REG(&SCG_0->SIRCCSR) = (uint32_t)config->enableMode;

    /* Wait for SIRC clock to be valid. */

    /*
     * $Branch Coverage Justification$
     * (CLOCK_REG(&SCG_0->SIRCCSR) & SCG_SIRCCSR_SIRCVLD_MASK) != SCG_SIRCCSR_SIRCVLD_MASK
     * not covered.
     * $ref clock_c_ref_2$.
     */
    while ((CLOCK_REG(&SCG_0->SIRCCSR) & SCG_SIRCCSR_SIRCVLD_MASK) != SCG_SIRCCSR_SIRCVLD_MASK)
    {
    }

    return (status_t)kStatus_Success;
}

/*!
 * brief De-initializes the SCG slow IRC.
 *
 * This function disables the SCG slow IRC.
 *
 * retval kStatus_Success SIRC is deinitialized.
 * retval kStatus_SCG_Busy SIRC is used by system clock.
 * retval kStatus_ReadOnly SIRC control register is locked.
 *
 * note This function can't detect whether the SIRC is used by an IP.
 */
status_t CLOCK_DeinitSirc(void)
{
    uint32_t reg = CLOCK_REG(&SCG_0->SIRCCSR);

    /* If clock is used by system, return error. */
    if ((reg & SCG_SIRCCSR_SIRCSEL_MASK) == SCG_SIRCCSR_SIRCSEL_MASK)
    {
        return (status_t)kStatus_SCG_Busy;
    }

    /* If configure register is locked, return error. */
    if ((reg & SCG_SIRCCSR_LK_MASK) == SCG_SIRCCSR_LK_MASK)
    {
        return (status_t)kStatus_ReadOnly;
    }

    CLOCK_REG(&SCG_0->SIRCCSR) = 0U;

