zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW43B43ZC7/drivers/fsl_clock.c
    return (status_t)kStatus_Success;
}

/*!
 * brief Gets the SCG SIRC clock frequency.
 *
 * return  Clock frequency; If the clock is invalid, returns 0.
 */
uint32_t CLOCK_GetSircFreq(void)
{
    /*
     * $Branch Coverage Justification$
     * (CLOCK_REG(&SCG_0->SIRCCSR) & SCG_SIRCCSR_SIRCVLD_MASK) != SCG_SIRCCSR_SIRCVLD_MASK
     * not covered.
     * $ref clock_c_ref_2$.
     */
    if ((CLOCK_REG(&SCG_0->SIRCCSR) & SCG_SIRCCSR_SIRCVLD_MASK) == SCG_SIRCCSR_SIRCVLD_MASK) /* SIRC is valid. */
    {
        return SCG_SIRC_FREQ;
    }
    else
    {
        return 0U;
    }
}

/*!
 * brief Initializes the SCG fast IRC clock.
 *
 * This function enables the SCG fast IRC clock according to the configuration.
 *
 * param config   Pointer to the configuration structure.
 * retval kStatus_Success FIRC is initialized.
 * retval kStatus_SCG_Busy FIRC has been enabled and is used by the system clock.
 * retval kStatus_ReadOnly FIRC control register is locked.
 *
 * note This function can't detect whether the FIRC has been enabled and
 * used by an IP.
 */
status_t CLOCK_InitFirc(const scg_firc_config_t *config)
{
    assert(config);

    status_t status;

    /* De-init the FIRC first. */
    status = CLOCK_DeinitFirc();

    if (kStatus_Success != status)
    {
        return status;
    }

    CLOCK_REG(&SCG_0->FIRCCFG) = SCG_FIRCCFG_RANGE(config->range);

    if (config->trimConfig != NULL)
    {
        CLOCK_REG(&SCG_0->FIRCTCFG) =
            SCG_FIRCTCFG_TRIMDIV(config->trimConfig->trimDiv) | SCG_FIRCTCFG_TRIMSRC(config->trimConfig->trimSrc);

        if (kSCG_FircTrimNonUpdate == config->trimConfig->trimMode)
        {
            CLOCK_REG(&SCG_0->FIRCSTAT) = SCG_FIRCSTAT_TRIMFINE(config->trimConfig->trimFine) |
                                          SCG_FIRCSTAT_TRIMCOAR(config->trimConfig->trimCoar);
        }

        /* Set trim mode. */
        CLOCK_REG(&SCG_0->FIRCCSR) = (uint32_t)config->trimConfig->trimMode;

        /*
         * $Branch Coverage Justification$
         * (CLOCK_REG(&SCG_0->FIRCCSR) & SCG_FIRCCSR_FIRCERR_MASK) == SCG_FIRCCSR_FIRCERR_MASK
         * not covered.
         * $ref clock_c_ref_3$.
         */
        if ((CLOCK_REG(&SCG_0->FIRCCSR) & SCG_FIRCCSR_FIRCERR_MASK) == SCG_FIRCCSR_FIRCERR_MASK)
        {
            return (status_t)kStatus_Fail;
        }
    }

    CLOCK_REG(&SCG_0->FIRCCSR) |= (SCG_FIRCCSR_FIRCEN_MASK | (uint32_t)config->enableMode);

    /* Wait for FIRC clock to be valid. */
    while ((CLOCK_REG(&SCG_0->FIRCCSR) & SCG_FIRCCSR_FIRCVLD_MASK) != SCG_FIRCCSR_FIRCVLD_MASK)
    {
    }

    return (status_t)kStatus_Success;
}

/*!
 * brief De-initializes the SCG fast IRC.
 *
 * This function disables the SCG fast IRC.
 *
 * retval kStatus_Success FIRC is deinitialized.
 * retval kStatus_SCG_Busy FIRC is used by the system clock.
 * retval kStatus_ReadOnly FIRC control register is locked.
 *
 * note This function can't detect whether the FIRC is used by an IP.
 */
status_t CLOCK_DeinitFirc(void)
{
    uint32_t reg = CLOCK_REG(&SCG_0->FIRCCSR);

    /* If clock is used by system, return error. */
    if ((reg & SCG_FIRCCSR_FIRCSEL_MASK) == SCG_FIRCCSR_FIRCSEL_MASK)
    {
        return (status_t)kStatus_SCG_Busy;
    }

    /* If configure register is locked, return error. */
    if ((reg & SCG_FIRCCSR_LK_MASK) == SCG_FIRCCSR_LK_MASK)
    {
        return (status_t)kStatus_ReadOnly;
    }

    CLOCK_REG(&SCG_0->FIRCCSR) = SCG_FIRCCSR_FIRCERR_MASK;

    return (status_t)kStatus_Success;
}

/*!
 * brief Gets the SCG FIRC clock frequency.
 *
 * return  Clock frequency; If the clock is invalid, returns 0.
 */
uint32_t CLOCK_GetFircFreq(void)
{
    static const uint32_t fircFreq[] = {48000000U, 64000000U, 96000000U, 192000000U};

    if ((CLOCK_REG(&SCG_0->FIRCCSR) & SCG_FIRCCSR_FIRCVLD_MASK) == SCG_FIRCCSR_FIRCVLD_MASK) /* FIRC is valid. */
    {
        return fircFreq[SCG_FIRCCFG_RANGE_VAL];
    }
    else
    {
        return 0U;
    }
}

/*!
 * brief Initializes the SCG ROSC.
 *
 * This function enables the SCG ROSC clock according to the
 * configuration.
 *
 * param config   Pointer to the configuration structure.
 * retval kStatus_Success ROSC is initialized.
 * retval kStatus_SCG_Busy ROSC has been enabled and is used by the system clock.
 * retval kStatus_ReadOnly ROSC control register is locked.
 *
 * note This function can't detect whether the system OSC has been enabled and
 * used by an IP.
 */
status_t CLOCK_InitRosc(const scg_rosc_config_t *config)
{
    assert(config);
    status_t status;

    /* De-init the ROSC first. */
    status = CLOCK_DeinitRosc();

    if (kStatus_Success != status)
    {
        return status;
    }

    CLOCK_SetRoscMonitorMode(config->monitorMode);

    /* Wait for ROSC clock to be valid. */
    while ((CLOCK_REG(&SCG_0->ROSCCSR) & SCG_ROSCCSR_ROSCVLD_MASK) != SCG_ROSCCSR_ROSCVLD_MASK)
    {
    }

    return (status_t)kStatus_Success;
}

/*!
 * brief De-initializes the SCG ROSC.
 *
 * This function disables the SCG ROSC clock.
 *
 * retval kStatus_Success System OSC is deinitialized.
 * retval kStatus_SCG_Busy System OSC is used by the system clock.
 * retval kStatus_ReadOnly System OSC control register is locked.
 *
 * note This function can't detect whether the ROSC is used by an IP.
 */
status_t CLOCK_DeinitRosc(void)
{
    uint32_t reg = CLOCK_REG(&SCG_0->ROSCCSR);

    /* If clock is used by system, return error. */
    if ((reg & SCG_ROSCCSR_ROSCSEL_MASK) == SCG_ROSCCSR_ROSCSEL_MASK)
    {
        return (status_t)kStatus_SCG_Busy;
    }

    /* If configure register is locked, return error. */
    if ((reg & SCG_ROSCCSR_LK_MASK) == SCG_ROSCCSR_LK_MASK)
    {
        return (status_t)kStatus_ReadOnly;
    }

    CLOCK_REG(&SCG_0->ROSCCSR) = SCG_ROSCCSR_ROSCERR_MASK;

    return (status_t)kStatus_Success;
}

/*!
 * @brief Gets the SCG RTC OSC clock frequency.
 *
 * @return  Clock frequency; If the clock is invalid, returns 0.
 */
uint32_t CLOCK_GetRtcOscFreq(void)
{
    if ((CLOCK_REG(&SCG_0->ROSCCSR) & SCG_ROSCCSR_ROSCVLD_MASK) ==
        SCG_ROSCCSR_ROSCVLD_MASK) /* RTC OSC clock is valid. */
    {
        /* Please call CLOCK_SetXtal32Freq base on board setting before using RTC OSC clock. */
        assert(g_xtal32Freq);
        return g_xtal32Freq;
    }
    else
    {
        return 0U;
    }
}

/*!
 * @brief Gets the clock frequency of the clock 1MHz, 1MHZ is derived out of FRO6M.
 *
 * @return  Clock frequency; If the clock is invalid, returns 0.
 */
uint32_t CLOCK_Get1MClkFreq(void)
{
    uint32_t sircFreq = CLOCK_GetSircFreq();
    uint32_t reg      = CLOCK_REG(kCLOCK_CLK_1M);

    assert(reg & MRCC_PR_MASK);

    if (0U == sircFreq)
    {
        return 0U;
    }
    else
    {
        if ((reg & MRCC_RSTB_MASK) != MRCC_RSTB_MASK)
        {
            /* Clock 1M is held in reset */
            return 0U;
        }

        if ((reg & MRCC_CC_MASK) == (uint32_t)kCLOCK_IpClkControl_fun0)
        {
            /* Clock 1M is disabled */
            return 0U;
        }

        return 1000000U;
    }
}

/*!
 * @brief Gets the frequency of the TSTMR.
 *
 * @param instance TSTMR instance.
 *
 * @return Clock frequency of the TSTMR instance; If the instance is invalid, returns 0.
 */
uint32_t CLOCK_GetTstmrFreq(uint32_t instance)
{
    assert(instance < FSL_FEATURE_SOC_TSTMR_COUNT);

    uint32_t freq;

    switch (instance)
    {
        case 0U:
            freq = CLOCK_GetIpFreq(kCLOCK_Tstmr0);
            break;
        case 1U:
        case 2U:
            freq = CLOCK_GetRtcOscFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq;
}
